Revit 2027 API
Path3d.AllCurveLoops Property
Get all the Curve Loops of Path3d.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveArrArray AllCurveLoops { get; }
Public ReadOnly Property AllCurveLoops As CurveArrArray
	Get
public:
property CurveArrArray^ AllCurveLoops {
	CurveArrArray^ get ();
}
member AllCurveLoops : CurveArrArray with get
Property Value
CurveArrArray
Remarks
Returns all the Curve Loops of Path3d.
See Also
Reference
Path3d Class
Autodesk.Revit.DB Namespace